app/controllers/notes_controller.rb

SELECT * FROM "notes"
---
  def index
    @notes = Note.all

SELECT * FROM "notes"
---
  def list
    @notes = Note.all

SELECT * FROM "notes"
---
  def table
	@notes = Note.all

SELECT * FROM "notes" WHERE ("notes"."id" = 1)
---
  def show
    @note = Note.find(params[:id])

SELECT * FROM "notes" WHERE ("notes"."id" = 3)
---
  def edit
    @note = Note.find(params[:id])

INSERT INTO "notes" ("updated_at", "title", "content", "created_at") VALUES('2010-08-17 05:42:36', 'Report on Africa', '', '2010-08-17 05:42:36')
---
  def create
    @note = Note.new(params[:note])
	if @note.save

SELECT * FROM "notes" WHERE ("notes"."id" = 3)
UPDATE "notes" SET "content" = 'Lorem ipsum dolor sit amet, consectetur adipisicing elit, sed do eiusmod tempor incididunt ut labore et dolore magna aliqua. Ut enim ad minim veniam, quis nostrud exercitation ullamco laboris nisi ut aliquip ex ea commodo consequat. Duis aute irure dolor in reprehenderit in voluptate velit esse cillum dolore eu fugiat nulla pariatur. Excepteur sint occaecat cupidatat non proident, sunt in culpa qui officia deserunt mollit anim id est laborum.', "updated_at" = '2010-08-17 08:46:24' WHERE "id" = 1
---
  def update
    note = Note.find(params[:id])

	if note.update_attributes(params[:note])

DELETE FROM "notes" WHERE "id" = 6
---
  def destroy
    #@note = Note.find(params[:id])
    #@note.destroy

	if Note.destroy(params[:id])