app/controllers/notes_controller.rb

SELECT * FROM "notes"
---
  def list_editable
    @notes = Note.all